RhinoInside.Revit API Documentation
ColorConverter Class
 Converter to convert Eto.Drawing.Color values to and from Autodesk.Revit.DB.Color.
Inheritance Hierarchy
System.Object
 RhinoInside.Revit.Convert.Eto.Drawing.ColorConverter
 Namespace: RhinoInside.Revit.Convert.Eto.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static class ColorConverter
class ColorConverter
Methods
Name | Description
ToColor(Color)
 Converts the specified Autodesk.Revit.DB.Color to an equivalent Eto.Drawing.Color.
ToColor(Color)
 Converts the specified Eto.Drawing.Color to an equivalent Autodesk.Revit.DB.Color.
Top
See Also
Reference
RhinoInside.Revit.Convert.Eto.Drawing Namespace